app/controllers/orders_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-07-25 08:01:54.658464"], ["updated_at", "2018-07-25 08:01:54.658464"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "fdfsd"], ["address", "fsdfsd"], ["email", "fsd"], ["pay_type", "Check"], ["created_at", "2018-07-25 07:58:49.026310"], ["updated_at", "2018-07-25 07:58:49.026310"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])