app/controllers/users_controller.rb

SELECT "users".* FROM "users"  ORDER BY "users"."name" ASC
---
  def index
    @users = User.order(:name)

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sano"], ["password_digest", "$2a$10$k8cU6iS5eWQlZm8tS.j6MO5KkydU1lyIP7S.9gee9NSSb/PY4Vr4S"], ["created_at", "2018-07-25 07:56:06.406865"], ["updated_at", "2018-07-25 07:56:06.406865"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    begin
  @user.destroy